Autodesk.Revit.DB.Analysis.SizingCalculator.EquivalentDiameter(Autodesk.Revit.DB.ConnectorProfileType,System.Double,System.Double)
Calculates the equivalent diameter based on the specified profile type, width, and height.
eShape:
The shape of the connector profile.
widthOrDiameter:
The width or diameter of the connector.
height:
The height of the connector.
Returns:
Returns the calculated equivalent diameter.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator.Velocity(System.Double,Autodesk.Revit.DB.Analysis.SizingOptions)
Calculates the velocity based on the specified parameters.
flow:
The flow rate.
options:
The sizing options containing other input parameters (such as profile type and size).
Returns:
Returns the calculated velocity.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator.Friction(System.Double,Autodesk.Revit.DB.Analysis.SizingOptions)
Calculates the friction based on the specified parameters.
flow:
The flow rate.
options:
The sizing options containing other input parameters (such as density, viscosity, roughness, size, etc.).
Returns:
Returns the calculated friction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator.CalculateSizeByFriction(System.Double,System.Double,Autodesk.Revit.DB.Analysis.SizingOptions)
Calculates the duct or pipe size based on the specified flow and friction.
flow:
The flow rate.
friction:
The desired friction.
sizingOptions:
The sizing options containing other input sizing parameters (such as density, viscosity, roughness, etc.) and output sizes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input must be initialized correctly for sizing operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for flow must be positive.
-or-
The given value for friction must be positive.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to calculate the size to satisfy the friction constraint.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator.CalculateSizeByVelocity(System.Double,System.Double,Autodesk.Revit.DB.Analysis.SizingOptions)
Calculates the duct or pipe size based on the specified flow and velocity.
flow:
The flow rate.
velocity:
The desired velocity.
sizingOptions:
The sizing options containing other input sizing parameters (such as density, viscosity, roughness, etc.) and output sizes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input must be initialized correctly for sizing operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for flow must be positive.
-or-
The given value for velocity must be positive.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to calculate the size to satisfy the velocity constraint.
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.SizingCalculator.#ctor(Autodesk.Revit.DB.Document)
Constructs an SizingCalculator instance.
document:
The document associated with this sizing calculator, used for accessing the calculation service in the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Analysis.SizingCalculator
Calculates the required duct or pipe size based on the specified parameters and constraints.
Remarks:
This class calculates duct and pipe sizes based on various constraints such as flow friction, and velocity.
Other parameters are often included in SizingOptions. The size result is also stored in the SizingOptions
after the calculation.
Since:
2027